Ran Plan for project: `kube-prometheus-stack` dir: `kube-prometheus-stack` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # helm_release.kube_prometheus_stack will be created
+ resource "helm_release" "kube_prometheus_stack" {
      + atomic                     = false
      + chart                      = "kube-prometheus-stack"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "kube-prometheus-stack"
      + namespace                  = "monitoring"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://prometheus-community.github.io/helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                fullnameOverride: "prometheus"
                
                prometheus:
                  prometheusSpec:
                    scrapeConfigSelector:
                      matchLabels: null
            EOT,
        ]
      + verify                     = false
      + version                    = "65.1.1"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # kubernetes_namespace.monitoring will be created
+ resource "kubernetes_namespace" "monitoring" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + name             = "monitoring"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.


Invalid attribute in provider configuration

  with provider["registry.terraform.io/hashicorp/kubernetes"],
  on provider.tf line 2, in provider "kubernetes":
   2: provider "kubernetes" {

'config_path' refers to an invalid path: "/home/atlantis/.kube/config": stat
/home/atlantis/.kube/config: no such file or directory
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p kube-prometheus-stack
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://10.0.0.0/lock?id=koorikla%252Fatlantis%252Fkube-prometheus-stack%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p kube-prometheus-stack
  ```
Plan: 2 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```